# Gun Violence Incident (2014-2021)

### This script contains data wrangling, data consistency check, and data profiling with descriptive analysis. 

1. Importing Libraries
2. Importing Data
3. Data consistency check
4. Data cleaning
5. Descriptive analysis

In [30]:
# Import Liabraries
import pandas as pd
import numpy as np
import os

In [2]:
#define path
path=r'/Users/yeji/Documents/Career Foundry/Achievement 6'

In [3]:
#define US_gun_violence csv.
df= pd.read_csv(os.path.join(path,'Data','Original Data','US_gun_violence.csv'), index_col = False)

In [4]:
#check head
df.head()

,incident_id,incident_date,state,city_or_county,address,killed,injured
0,2201535,December 31 2021,Maryland,Capitol Heights,Cindy Ln,0,4.0
1,2201716,December 31 2021,Mississippi,Gulfport,1200 block of Lewis Ave,3,4.0
2,2201216,December 31 2021,California,Los Angeles,10211 S. Avalon Blvd,0,6.0
3,2200968,December 30 2021,Pennsylvania,Philadelphia,5100 block of Germantown Ave,0,6.0
4,2201052,December 30 2021,Missouri,Kirksville,700 block of E Dodson St,2,2.0

In [5]:
#check shape
df.shape

(3391, 7)

In [6]:
#check data type
df.dtypes

incident_id         int64
incident_date      object
state              object
city_or_county     object
address            object
killed              int64
injured           float64
dtype: object

In [7]:
#descriptive analysis
df.describe()

        incident_id       killed      injured
count  3.391000e+03  3391.000000  3389.000000
mean   1.236033e+06     1.054851     4.182650
std    6.459642e+05     2.046927     7.841665
min    9.219400e+04     0.000000     0.000000
25%    6.347590e+05     0.000000     3.000000
50%    1.314253e+06     1.000000     4.000000
75%    1.799726e+06     1.000000     5.000000
max    2.201716e+06    59.000000   441.000000

In [8]:
#change data type for incident_id from integer to string
df['incident_id'] = df['incident_id'].astype('str')

In [9]:
#check for mixed data type
for col in df.columns.tolist(): weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df[weird]) > 0: print (col)

In [10]:
#check for missing values 
df.isnull().sum()

incident_id       0
incident_date     0
state             0
city_or_county    0
address           5
killed            0
injured           2
dtype: int64

In [11]:
# create dataframe with missing values
df_nan = df[df['address'].isnull()==True]

In [12]:
df_nan

,incident_id,incident_date,state,city_or_county,address,killed,injured
1038,1725735,July 4 2020,South Carolina,Red Oak,NaN,0,5.0
1808,1206476,September 9 2018,Florida,Jacksonville,NaN,0,4.0
2430,716001,December 1 2016,California,Clearlake Oaks,NaN,1,3.0
2879,411888,September 8 2015,Georgia,Berlin,NaN,0,4.0
3342,120621,March 30 2014,Mississippi,Starkville,NaN,0,5.0

In [13]:
#create dataframe with missing values for injured
df_nan_injured = df[df['injured'].isnull()==True]

In [14]:
df_nan_injured

,incident_id,incident_date,state,city_or_county,address,killed,injured
212,2115336,September 5 2021,Missouri,Wyatt,0,4,NaN
268,2089557,August 10 2021,Mississippi,Clarksdale,2,2,NaN

In [15]:
#create new dataframe without missing values in injured 
df_clean=df[df['injured'].isnull()==False]

In [16]:
df_clean.shape

(3389, 7)

In [17]:
#check for duplicates
df_clean_dups = df_clean[df_clean.duplicated()]

In [18]:
df_clean_dups

Empty DataFrame
Columns: [incident_id, incident_date, state, city_or_county, address, killed, injured]
Index: []

In [19]:
#change datatype for injured from float to int
df_clean['injured'] = df_clean['injured'].astype('int')

/var/folders/7c/wd1dsfj543j4h3klbp_x650w0000gn/T/ipykernel_19939/82705425.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['injured'] = df_clean['injured'].astype('int')

In [20]:
#check datatypes
df_clean.dtypes

incident_id       object
incident_date     object
state             object
city_or_county    object
address           object
killed             int64
injured            int64
dtype: object

In [21]:
#check descriptive statistic of new cleaned data
df_clean.describe()

            killed      injured
count  3389.000000  3389.000000
mean      1.053703     4.182650
std       2.046841     7.841665
min       0.000000     0.000000
25%       0.000000     3.000000
50%       1.000000     4.000000
75%       1.000000     5.000000
max      59.000000   441.000000

In [22]:
#split incident date from month, day and year
month = df_clean['incident_date'].str.split(pat = ' ', n = 1, expand = True)

In [23]:
#check 
month

             0        1
0     December  31 2021
1     December  31 2021
2     December  31 2021
3     December  30 2021
4     December  30 2021
...        ...      ...
3386   January  12 2014
3387   January  11 2014
3388   January   5 2014
3389   January   3 2014
3390   January   1 2014

[3389 rows x 2 columns]

In [24]:
#split day and year on incident date
day_year = month[1].str.split(pat = ' ',n=1, expand = True)

In [25]:
#check
day_year

       0     1
0     31  2021
1     31  2021
2     31  2021
3     30  2021
4     30  2021
...   ..   ...
3386  12  2014
3387  11  2014
3388   5  2014
3389   3  2014
3390   1  2014

[3389 rows x 2 columns]

In [26]:
#insert new columns in df_clean
df_clean.insert(loc = 2, column = 'month', value = month[0])
df_clean.insert(loc = 3, column = 'day', value = day_year[0])
df_clean.insert(loc = 4, column = 'year', value = day_year[1])

In [27]:
#check head
df_clean.head()

,incident_id,incident_date,month,day,year,state,city_or_county,address,killed,injured
0,2201535,December 31 2021,December,31,2021,Maryland,Capitol Heights,Cindy Ln,0,4
1,2201716,December 31 2021,December,31,2021,Mississippi,Gulfport,1200 block of Lewis Ave,3,4
2,2201216,December 31 2021,December,31,2021,California,Los Angeles,10211 S. Avalon Blvd,0,6
3,2200968,December 30 2021,December,30,2021,Pennsylvania,Philadelphia,5100 block of Germantown Ave,0,6
4,2201052,December 30 2021,December,30,2021,Missouri,Kirksville,700 block of E Dodson St,2,2

In [28]:
df_clean.tail()

,incident_id,incident_date,month,day,year,state,city_or_county,address,killed,injured
3386,95550,January 12 2014,January,12,2014,Alabama,Huntsville,University Drive,0,5
3387,95146,January 11 2014,January,11,2014,Mississippi,Jackson,3430 W. Capitol Street,0,4
3388,94514,January 5 2014,January,5,2014,Pennsylvania,Erie,829 Parade St,1,3
3389,92704,January 3 2014,January,3,2014,New York,Queens,Farmers Boulevard and 133rd Avenue,1,3
3390,92194,January 1 2014,January,1,2014,Virginia,Norfolk,Rockingham Street and Berkley Avenue Extended,2,2

In [31]:
df_clean.shape

(3389, 10)

In [32]:
#export cleaned data
df_clean.to_csv(os.path.join(path, 'Data','Prepared Data', 'data_cleaned.csv'))